19-sessions-cookies/app/controllers/answers_controller.rb

    def new
        @user = session[:user_id] ? User.find(session[:user_id]) : nil
        @instructor = Instructor.all.sample
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "instructors".* FROM "instructors"

    def create
        question = Question.create({instructor_id: params[:answer][:instructor_id]})
        answer = Answer.create(answer_params)
        answer.question = question
        if answer.valid? && answer.user.valid?
            answer.save
---
INSERT INTO "answers" ("question_id", "cookie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question_id", 1], ["cookie_id", 10], ["created_at", "2019-05-27 13:02:27.194498"], ["updated_at", "2019-05-27 13:02:27.194498"]]
INSERT INTO "questions" ("instructor_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["instructor_id", 53], ["created_at", "2019-09-05 15:35:58.383734"], ["updated_at", "2019-09-05 15:35:58.383734"]]
INSERT INTO "answers" ("question_id", "cookie_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["question_id", 4], ["cookie_id", 5], ["created_at", "2019-06-13 15:44:47.279094"], ["updated_at", "2019-06-13 15:44:47.279094"], ["user_id", 3]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sam"], ["created_at", "2019-05-27 13:37:09.927598"], ["updated_at", "2019-05-27 13:37:09.927598"]]
INSERT INTO "answers" ("question_id", "cookie_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["question_id", 13], ["cookie_id", 14], ["created_at", "2019-07-04 15:33:42.777989"], ["updated_at", "2019-07-04 15:33:42.777989"], ["user_id", 1]]